In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [65]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000, 'California':5000}
obj3 = pd.Series(sdata)

In [66]:
obj3

Ohio          35000
Texas         71000
Oregon        16000
Utah           5000
California     5000
dtype: int64

In [67]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)

In [68]:
obj4

California     5000
Ohio          35000
Oregon        16000
Texas         71000
dtype: int64

In [18]:
data = {'states': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000, 2001, 2002, 2001, 2002, 2003],
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [19]:
frame = pd.DataFrame(data)

In [20]:
frame

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [69]:
frame.sort_index(ascending=False)

   states  year  pop
5  Nevada  2003  3.2
4  Nevada  2002  2.9
3  Nevada  2001  2.4
2    Ohio  2002  3.6
1    Ohio  2001  1.7
0    Ohio  2000  1.5

In [82]:
pop = {'Nevada':{2000:2.4, 2002:2.9}, 'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}

In [83]:
frame3 = pd.DataFrame(pop)

In [86]:
frame3.sort_index(ascending=False)

      Nevada  Ohio
2002     2.9   3.6
2001     NaN   1.7
2000     2.4   1.5

In [88]:
# frame3.sort_values(by='Nevada', na_position='first')
frame3.sort_values(by='Nevada', na_position='last')

      Nevada  Ohio
2000     2.4   1.5
2002     2.9   3.6
2001     NaN   1.7

In [57]:
frame3['Ohio'][:-1]

2000    1.5
2002    3.6
Name: Ohio, dtype: float64

In [89]:
s1 = pd.Series(data=[1,2,3], index=['a','b','c'])
s2 = pd.Series(data=[4,5,6], index=['a','b','c'])
s3 = pd.Series(data=[7,8,9], index=['a','b','c'])
df3 = pd.DataFrame(data=[s1,s2,s3])

In [90]:
df3

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [97]:
df3 = pd.DataFrame(data=[s1,s2,s3], columns=['a','b','c'])

In [98]:
df3

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [99]:
list = [
    {'name':'kim', 'age':20, 'job':'designer'},
     {'name':'lee', 'age':21, 'job':'programmer'},
     {'name':'park', 'age':22, 'job':'data'}
]

In [100]:
df = pd.DataFrame(list)
df

   name  age         job
0   kim   20    designer
1   lee   21  programmer
2  park   22        data

In [101]:
df = df[['name', 'job', 'age']]

In [102]:
df

   name         job  age
0   kim    designer   20
1   lee  programmer   21
2  park        data   22

In [103]:
from collections import OrderedDict

In [106]:
ordered_dict = OrderedDict([['name', ['kim', 'lee', 'park']],
                           ['age', [20,21,19]],
                           ['job', ['designer','programmer','dba']]
                           ])

In [107]:
pd.DataFrame(ordered_dict)

   name  age         job
0   kim   20    designer
1   lee   21  programmer
2  park   19         dba

In [ ]:
dict1 = { 'age':[20,21,19],
         'name':['kim', 'lee', 'park'],
         'job':['designer','programmer','dba']}

In [111]:
pd.DataFrame(dict1)

   age  name         job
0   20   kim    designer
1   21   lee  programmer
2   19  park         dba

In [112]:
ordered_dict2 = OrderedDict([('name', ('kim', 'lee', 'park')),
                           ['age', (20,21,19)],
                           ['job', ('designer','programmer','dba')]
                           ])

In [113]:
pd.DataFrame(ordered_dict2)

   name  age         job
0   kim   20    designer
1   lee   21  programmer
2  park   19         dba

In [123]:
# list1 = [{'age':[20,21,19]},
#          {'name':['kim', 'lee', 'park']},
#          {'job':['designer','programmer','dba']}]
list1 = {'age':[20,21,19],
         'name':['kim', 'lee', 'park'],
         'job':['designer','programmer','dba']}

In [124]:
pd.DataFrame(list1)

   age  name         job
0   20   kim    designer
1   21   lee  programmer
2   19  park         dba

In [119]:
list2 = OrderedDict([['age',[20,21,19]],
         ['name',['kim', 'lee', 'park']],
         ['job',['designer','programmer','dba']]])

In [125]:
df = pd.DataFrame(list2)

In [126]:
df

   age  name         job
0   20   kim    designer
1   21   lee  programmer
2   19  park         dba

In [127]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      int64
 1   name    3 non-null      object
 2   job     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [128]:
df.describe()

        age
count   3.0
mean   20.0
std     1.0
min    19.0
25%    19.5
50%    20.0
75%    20.5
max    21.0